app/views/books/show.html.erb

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
      <div class="comments">
        <p>コメント件数:<%= @book.book_comments.count %></p>
        <% @book.book_comments.each do |book_comment| %>