app/controllers/books_controller.rb

INSERT INTO "books" ("created_at", "updated_at", "title", "body", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2021-02-18 11:27:29.945751"], ["updated_at", "2021-02-18 11:27:29.945751"], ["title", "ijijiji"], ["body", "jijijiji"], ["user_id", 9]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book), notice: "You have created book successfully."
    else
      @books = Book.all